{
  "_class_name": "OriginalWanTransformerModel",
  "pretrained_model_name_or_path": "Wan2_1-I2V-14B-480p_fp8_e4m3fn_scaled_KJ.safetensors",
  "infinite_talk_model_name_or_path": "Wan2_1-InfiniteTalk-Single_fp8_e4m3fn_scaled_KJ.safetensors",
  "_diffusers_version": "0.33.0.dev0",
  "added_kv_proj_dim": 5120,
  "attention_head_dim": 128,
  "cross_attn_norm": true,
  "eps": 1e-06,
  "ffn_dim": 13824,
  "freq_dim": 256,
  "image_dim": 1280,
  "in_channels": 36,
  "num_attention_heads": 40,
  "num_layers": 40,
  "out_channels": 16,
  "patch_size": [
    1,
    2,
    2
  ],
  "qk_norm": "rms_norm_across_heads",
  "rope_max_seq_len": 1024,
  "text_dim": 4096
}
